In [1]:
import numpy as np
import pandas as pd

In [2]:
labels =['a', 'b','c']
my_data= [10,20,30]
arr = np.array(my_data)
d={'a':10, 'b':20 , 'c':30}

In [3]:
pd.Series(data= my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [6]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [11]:
d=pd.DataFrame(np.random.randn(5,4), [1,2,3,4,5], ['w','a','s','d'] )

In [12]:
d

          w         a         s         d
1 -0.234317 -0.791400 -0.255904  1.558625
2 -0.610529  0.640097 -0.217211  0.149916
3  0.229274  0.295379  0.860526 -0.736615
4 -0.337267 -0.686156 -0.706252  0.678750
5  0.833777 -0.164844 -0.296019  0.574974

In [17]:
d['new']=d['w']+d['a']
d

          w         a         s         d       new
1 -0.234317 -0.791400 -0.255904  1.558625 -1.025717
2 -0.610529  0.640097 -0.217211  0.149916  0.029568
3  0.229274  0.295379  0.860526 -0.736615  0.524653
4 -0.337267 -0.686156 -0.706252  0.678750 -1.023424
5  0.833777 -0.164844 -0.296019  0.574974  0.668933

In [23]:
d.drop('new',axis=1,inplace=True)

In [29]:
d.shape

(5, 4)

In [34]:
d[['w','s']]

          w         s
1 -0.234317 -0.255904
2 -0.610529 -0.217211
3  0.229274  0.860526
4 -0.337267 -0.706252
5  0.833777 -0.296019

In [39]:
# rows
d.loc[[1,2,3],['w','s']]

          w         s
1 -0.234317 -0.255904
2 -0.610529 -0.217211
3  0.229274  0.860526

In [47]:
d[(d['w'] >0) & (d['a'] <0)][['w','a','s']]

          w         a         s
5  0.833777 -0.164844 -0.296019

In [59]:
newind= 'akash pal is my name '.split()
newind

['akash', 'pal', 'is', 'my', 'name']

In [61]:
d['new']=newind
d

          w         a         s         d    new
1 -0.234317 -0.791400 -0.255904  1.558625  akash
2 -0.610529  0.640097 -0.217211  0.149916    pal
3  0.229274  0.295379  0.860526 -0.736615     is
4 -0.337267 -0.686156 -0.706252  0.678750     my
5  0.833777 -0.164844 -0.296019  0.574974   name

In [62]:
d.set_index('new')

              w         a         s         d
new
akash -0.234317 -0.791400 -0.255904  1.558625
pal   -0.610529  0.640097 -0.217211  0.149916
is     0.229274  0.295379  0.860526 -0.736615
my    -0.337267 -0.686156 -0.706252  0.678750
name   0.833777 -0.164844 -0.296019  0.574974

In [69]:
d.dtypes

w      float64
a      float64
s      float64
d      float64
new     object
dtype: object